{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "BBA- Bachelor of Business Administration",
    "1": "BEM- Bachelor of Event Management",
    "10": "BCA- Bachelor of Computer Applications",
    "11": "B.Sc.- Information Technology",
    "12": "B.Sc- Nursing",
    "13": "BPharma- Bachelor of Pharmacy",
    "14": "BDS- Bachelor of Dental Surgery",
    "15": "Animation, Graphics and Multimedia",
    "16": "B.Sc- Applied Geology",
    "17": "B.Sc.- Physics",
    "18": "B.Sc. Chemistry",
    "19": "B.Sc. Mathematics",
    "2": "Integrated Law Course- BA + LL.B",
    "20": "B.Tech.-Civil Engineering",
    "21": "B.Tech.-Computer Science and Engineering",
    "22": "B.Tech.-Electronics and Communication Engineering",
    "23": "B.Tech.-Electrical and Electronics Engineering",
    "24": "B.Tech.-Mechanical Engineering",
    "25": "B.Com- Bachelor of Commerce",
    "26": "BA in Economics",
    "27": "CA- Chartered Accountancy",
    "28": "CS- Company Secretary",
    "29": "Diploma in Dramatic Arts",
    "3": "BJMC- Bachelor of Journalism and Mass Communication",
    "30": "MBBS",
    "31": "Civil Services",
    "32": "BA in English",
    "33": "BA in Hindi",
    "34": "B.Ed.",
    "35": "Psychology and Arts related careers",
    "36": "Sociology and Public Policy related careers",
    "37": "Marketing and Data Analysis related careers",
    "38": "Political Science and Writing related careers",
    "39": "Agriculture and Technology related careers",
    "4": "BFD- Bachelor of Fashion Designing",
    "40": "Environmental Science and Law related careers",
    "41": "Music and Business Management related careers",
    "42": "Sports and Physical Therapy related careers",
    "43": "Philosophy and Computer Science related careers",
    "44": "Human Resources and Psychology related careers",
    "45": "Public Health and Social Work related careers",
    "46": "Creative Writing and Gaming related careers",
    "47": "Robotics and Education related careers",
    "48": "Nutrition and Fitness related careers",
    "49": "History and Archaeology related careers",
    "5": "BBS- Bachelor of Business Studies",
    "50": "Graphic Design and Web Development related careers",
    "51": "Finance and Criminology related careers",
    "52": "Aerospace Engineering and Astronomy related careers",
    "53": "Theater and Psychology related careers",
    "54": "Urban Planning and Sustainability related careers",
    "55": "Linguistics and Artificial Intelligence related careers",
    "56": "Marine Biology and Photography related careers",
    "57": "Genetics and Bioinformatics related careers",
    "58": "Cybersecurity and Law related careers",
    "59": "Journalism and Documentary Filmmaking related careers",
    "6": "BTTM- Bachelor of Travel and Tourism Management",
    "60": "Industrial Design and Materials Science related careers",
    "61": "Physics and Renewable Energy related careers",
    "62": "Cognitive Science and UX Design related careers",
    "63": "Forensic Science and Chemistry related careers",
    "64": "Business Analytics and Supply Chain Management related careers",
    "7": "BVA- Bachelor of Visual Arts",
    "8": "BA in History",
    "9": "B.Arch- Bachelor of Architecture"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Aerospace Engineering and Astronomy related careers": 52,
    "Agriculture and Technology related careers": 39,
    "Animation, Graphics and Multimedia": 15,
    "B.Arch- Bachelor of Architecture": 9,
    "B.Com- Bachelor of Commerce": 25,
    "B.Ed.": 34,
    "B.Sc- Applied Geology": 16,
    "B.Sc- Nursing": 12,
    "B.Sc. Chemistry": 18,
    "B.Sc. Mathematics": 19,
    "B.Sc.- Information Technology": 11,
    "B.Sc.- Physics": 17,
    "B.Tech.-Civil Engineering": 20,
    "B.Tech.-Computer Science and Engineering": 21,
    "B.Tech.-Electrical and Electronics Engineering": 23,
    "B.Tech.-Electronics and Communication Engineering": 22,
    "B.Tech.-Mechanical Engineering": 24,
    "BA in Economics": 26,
    "BA in English": 32,
    "BA in Hindi": 33,
    "BA in History": 8,
    "BBA- Bachelor of Business Administration": 0,
    "BBS- Bachelor of Business Studies": 5,
    "BCA- Bachelor of Computer Applications": 10,
    "BDS- Bachelor of Dental Surgery": 14,
    "BEM- Bachelor of Event Management": 1,
    "BFD- Bachelor of Fashion Designing": 4,
    "BJMC- Bachelor of Journalism and Mass Communication": 3,
    "BPharma- Bachelor of Pharmacy": 13,
    "BTTM- Bachelor of Travel and Tourism Management": 6,
    "BVA- Bachelor of Visual Arts": 7,
    "Business Analytics and Supply Chain Management related careers": 64,
    "CA- Chartered Accountancy": 27,
    "CS- Company Secretary": 28,
    "Civil Services": 31,
    "Cognitive Science and UX Design related careers": 62,
    "Creative Writing and Gaming related careers": 46,
    "Cybersecurity and Law related careers": 58,
    "Diploma in Dramatic Arts": 29,
    "Environmental Science and Law related careers": 40,
    "Finance and Criminology related careers": 51,
    "Forensic Science and Chemistry related careers": 63,
    "Genetics and Bioinformatics related careers": 57,
    "Graphic Design and Web Development related careers": 50,
    "History and Archaeology related careers": 49,
    "Human Resources and Psychology related careers": 44,
    "Industrial Design and Materials Science related careers": 60,
    "Integrated Law Course- BA + LL.B": 2,
    "Journalism and Documentary Filmmaking related careers": 59,
    "Linguistics and Artificial Intelligence related careers": 55,
    "MBBS": 30,
    "Marine Biology and Photography related careers": 56,
    "Marketing and Data Analysis related careers": 37,
    "Music and Business Management related careers": 41,
    "Nutrition and Fitness related careers": 48,
    "Philosophy and Computer Science related careers": 43,
    "Physics and Renewable Energy related careers": 61,
    "Political Science and Writing related careers": 38,
    "Psychology and Arts related careers": 35,
    "Public Health and Social Work related careers": 45,
    "Robotics and Education related careers": 47,
    "Sociology and Public Policy related careers": 36,
    "Sports and Physical Therapy related careers": 42,
    "Theater and Psychology related careers": 53,
    "Urban Planning and Sustainability related careers": 54
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.56.0",
  "vocab_size": 30522
}
